app/controllers/messages_controller.rb

  def create
    sender = current_user
    relationship = Relationship.find_by(id: params[:relationship_id])
    receiver = sender == relationship.user_1 ?  relationship.user_2 : relationship.user_1
    new_message = relationship.messages.build(sender_id: sender.id, receiver_id: receiver.id, content: params[:content])
    if new_message.save
---
SELECT "relationships".* FROM "relationships" WHERE "relationships"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
INSERT INTO "messages" ("sender_id", "receiver_id", "content", "relationship_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["sender_id", 48], ["receiver_id", 30], ["content", ""], ["relationship_id", 30], ["created_at", "2019-11-13 15:51:50.317394"], ["updated_at", "2019-11-13 15:51:50.317394"]]