app/controllers/relationships_controller.rb

INSERT INTO "relationships" ("user_1_id", "user_2_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_1_id", 48], ["user_2_id", 30], ["created_at", "2019-11-12 20:12:38.842004"], ["updated_at", "2019-11-12 20:12:38.842004"]]
SELECT "relationships".* FROM "relationships" WHERE "relationships"."pending" = $1 AND "relationships"."user_1_id" = $2 AND "relationships"."user_2_id" = $3 LIMIT $4  [["pending", true], ["user_1_id", 48], ["user_2_id", 30], ["LIMIT", 1]]
INSERT INTO "relationships" ("user_1_id", "user_2_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_1_id", 8], ["user_2_id", 9], ["created_at", "2019-11-12 19:53:01.494465"], ["updated_at", "2019-11-12 19:53:01.494465"]]
---
  def create

    rel = Relationship.find_or_create_by(pending: true, user_1: current_user, user_2_id: params[:user_id])
    if rel.valid?
      render json: {user: rel.user_2, relationship_id: rel.id, pending: rel.pending, messages: rel.messages, created_at: rel.created_at}

SELECT "relationships".* FROM "relationships" WHERE "relationships"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
UPDATE "relationships" SET "pending" = $1, "updated_at" = $2 WHERE "relationships"."id" = $3  [["pending", false], ["updated_at", "2019-11-12 21:09:08.159741"], ["id", 30]]
DELETE FROM "relationships" WHERE "relationships"."id" = $1  [["id", 32]]
---
  def accept_or_decline
    relationship = Relationship.find_by(id: params[:relationship_id])
    if params[:decision] == "accept"
      relationship.pending = true
      relationship.save
      render json: {message: "relationship accepted", data: relationship}
    elsif params[:decision] == "decline"
      relationship.destroy