app/controllers/reviews_controller.rb

  def create
    user = User.find(params[:user_id])
    relationship = user.relationships & current_user.relationships
    if relationship.size > 0
      review = Review.new(comment: params[:comment], user: user)
      if review.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("comment", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["comment", "I REALLY take it all back now!"], ["user_id", 1], ["created_at", "2019-11-13 21:51:06.890757"], ["updated_at", "2019-11-13 21:51:06.890757"]]