app/controllers/users_controller.rb

  def create
    puts user_params
    user = User.new(user_params)
    puts user
    if user.save
---
INSERT INTO "users" ("email", "display_name", "age", "bio", "gender", "looking_for", "zip_code", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def index
    users = User.all.map {|user| UserSerializer.new(user)}
---
SELECT "users".* FROM "users"

  def relationships
    user  = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]