app/models/user.rb

SELECT "users".* FROM "users"
---
  def relationships_with_messages
    payload = self.relationships.map {|rel|